; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v8 ?v1)
             (pred_6 ?v5 ?v4)
             (pred_3 ?v8 ?v4)
             (pred_4 ?v9 ?v8 )
	     (pred_7 ?v8)
             (pred_10 ?v6)
             (pred_1 ?v5)
             (pred_11 ?v4)
             (pred_8 ?v8)
             (pred_2 ?v5)
             (pred_12 ?v8)
             (pred_9 ))



(:action op_2
:parameters (?v11 ?v2 ?v12 ?v10)
:precondition (and (pred_10 ?v11) (pred_10 ?v2) (pred_1 ?v12) (pred_11 ?v10)
          (pred_5 ?v11 ?v2) (pred_6 ?v12 ?v10)
                   (pred_3 ?v2 ?v10) (pred_7 ?v11) 
                   (pred_8 ?v2) (pred_2 ?v12))
:effect (and  (pred_12 ?v2) (not (pred_8 ?v2))))


(:action op_1
:parameters (?v11 ?v7)
:precondition (and (pred_10 ?v11) (pred_10 ?v7)
               (pred_7 ?v11) (pred_5 ?v11 ?v7) (pred_12 ?v7))
:effect (and (pred_7 ?v7) (not (pred_7 ?v11))))

(:action op_3
:parameters (?v11 ?v12)
:precondition (and (pred_10 ?v11) (pred_1 ?v12) 
                  (pred_7 ?v11) (pred_4 ?v12 ?v11) (pred_9 ))
:effect (and (pred_2 ?v12)
   (not (pred_4 ?v12 ?v11)) (not (pred_9 ))))


(:action op_5
:parameters (?v11 ?v13 ?v3)
:precondition (and (pred_10 ?v11) (pred_1 ?v13) (pred_1 ?v3)
                  (pred_7 ?v11) (pred_2 ?v3) (pred_4 ?v13 ?v11))
:effect (and (pred_2 ?v13) (pred_4 ?v3 ?v11)
        (not (pred_2 ?v3)) (not (pred_4 ?v13 ?v11))))

(:action op_4
:parameters (?v11 ?v12)
:precondition (and (pred_10 ?v11) (pred_1 ?v12) 
                  (pred_7 ?v11) (pred_2 ?v12))
:effect (and (pred_9 ) (pred_4 ?v12 ?v11) (not (pred_2 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_11 obj_19 obj_09 obj_14 obj_06 obj_20 obj_03 obj_18 obj_02 obj_21 obj_17 obj_12 obj_10 obj_01 obj_04 obj_15
    obj_08 obj_16
    obj_05 obj_07 obj_13
    )

    (:init
       (pred_9)

       (pred_10 obj_11)
       (pred_10 obj_19)
       (pred_10 obj_09)
       (pred_10 obj_14)
       (pred_10 obj_06)
       (pred_10 obj_20)
       (pred_10 obj_03)
       (pred_10 obj_18)
       (pred_10 obj_02)
       (pred_10 obj_21)
       (pred_10 obj_17)
       (pred_10 obj_12)
       (pred_10 obj_10)
       (pred_10 obj_01)
       (pred_10 obj_04)
       (pred_10 obj_15)
       (pred_11 obj_08)
       (pred_11 obj_16)
       (pred_1 obj_05)
       (pred_1 obj_07)
       (pred_1 obj_13)

       (pred_5 obj_11 obj_06)
       (pred_5 obj_11 obj_19)
       (pred_5 obj_19 obj_20)
       (pred_5 obj_19 obj_09)
       (pred_5 obj_19 obj_11)
       (pred_5 obj_09 obj_03)
       (pred_5 obj_09 obj_14)
       (pred_5 obj_09 obj_19)
       (pred_5 obj_14 obj_18)
       (pred_5 obj_14 obj_09)
       (pred_5 obj_06 obj_02)
       (pred_5 obj_06 obj_20)
       (pred_5 obj_06 obj_11)
       (pred_5 obj_20 obj_21)
       (pred_5 obj_20 obj_03)
       (pred_5 obj_20 obj_19)
       (pred_5 obj_20 obj_06)
       (pred_5 obj_03 obj_17)
       (pred_5 obj_03 obj_18)
       (pred_5 obj_03 obj_09)
       (pred_5 obj_03 obj_20)
       (pred_5 obj_18 obj_12)
       (pred_5 obj_18 obj_14)
       (pred_5 obj_18 obj_03)
       (pred_5 obj_02 obj_10)
       (pred_5 obj_02 obj_21)
       (pred_5 obj_02 obj_06)
       (pred_5 obj_21 obj_01)
       (pred_5 obj_21 obj_17)
       (pred_5 obj_21 obj_20)
       (pred_5 obj_21 obj_02)
       (pred_5 obj_17 obj_04)
       (pred_5 obj_17 obj_12)
       (pred_5 obj_17 obj_03)
       (pred_5 obj_17 obj_21)
       (pred_5 obj_12 obj_15)
       (pred_5 obj_12 obj_18)
       (pred_5 obj_12 obj_17)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_10 obj_02)
       (pred_5 obj_01 obj_04)
       (pred_5 obj_01 obj_21)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_04 obj_15)
       (pred_5 obj_04 obj_17)
       (pred_5 obj_04 obj_01)
       (pred_5 obj_15 obj_12)
       (pred_5 obj_15 obj_04)
       (pred_8 obj_15)
       (pred_8 obj_09)
       (pred_8 obj_21)
       (pred_3  obj_15 obj_08)
       (pred_3  obj_09 obj_16)
       (pred_3  obj_21 obj_16)
       (pred_12 obj_11)
       (pred_12 obj_19)
       (pred_12 obj_14)
       (pred_12 obj_06)
       (pred_12 obj_20)
       (pred_12 obj_03)
       (pred_12 obj_18)
       (pred_12 obj_02)
       (pred_12 obj_17)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_04)

       (pred_6  obj_05 obj_08)
       (pred_6  obj_07 obj_16)
       (pred_6  obj_13 obj_16)
       (pred_4 obj_05 obj_11)
       (pred_4 obj_07 obj_01)
       (pred_4 obj_13 obj_20)
       (pred_7 obj_03)
    )

    (:goal (and
       (pred_4 obj_05 obj_04)
       (pred_4 obj_13 obj_04)
    ))
(:constraints
  (always (not (pred_7 obj_19)))
)
)

; plan
1. (op_1 obj_03 obj_20)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_20)
   goals met: 0 of 2
2. (op_1 obj_20 obj_06)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_06)
   goals met: 0 of 2
3. (op_1 obj_06 obj_11)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_11)
   goals met: 0 of 2
4. (op_3 obj_11 obj_05)
   deleted: (pred_4 obj_05 obj_11) (pred_9)
   added: (pred_2 obj_05)
   goals met: 0 of 2
5. (op_1 obj_11 obj_06)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_06)
   goals met: 0 of 2
6. (op_1 obj_06 obj_20)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_20)
   goals met: 0 of 2
7. (op_1 obj_20 obj_03)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_03)
   goals met: 0 of 2
8. (op_1 obj_03 obj_17)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_17)
   goals met: 0 of 2
9. (op_1 obj_17 obj_04)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_04)
   goals met: 0 of 2
10. (op_4 obj_04 obj_05)
   deleted: (pred_2 obj_05)
   added: (pred_9) (pred_4 obj_05 obj_04)
   goals met: 1 of 2
11. (op_1 obj_04 obj_17)
   deleted: (pred_7 obj_04)
   added: (pred_7 obj_17)
   goals met: 1 of 2
12. (op_1 obj_17 obj_03)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_03)
   goals met: 1 of 2
13. (op_1 obj_03 obj_20)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_20)
   goals met: 1 of 2
14. (op_3 obj_20 obj_13)
   deleted: (pred_4 obj_13 obj_20) (pred_9)
   added: (pred_2 obj_13)
   goals met: 1 of 2
15. (op_1 obj_20 obj_03)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_03)
   goals met: 1 of 2
16. (op_1 obj_03 obj_17)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_17)
   goals met: 1 of 2
17. (op_1 obj_17 obj_04)
   deleted: (pred_7 obj_17)
   added: (pred_7 obj_04)
   goals met: 1 of 2
18. (op_4 obj_04 obj_13)
   deleted: (pred_2 obj_13)
   added: (pred_9) (pred_4 obj_13 obj_04)
   goals met: 2 of 2
